# --- Theme & Prompt 
wintermi/zsh-oh-my-posh

# Zephyr
mattmc3/zephyr path:plugins/confd
#mattmc3/zephyr path:plugins/environment
mattmc3/zephyr path:plugins/history
mattmc3/zsh_custom path:plugins/xdg

# --- Core & Framework
mattmc3/ez-compinit
marlonrichert/zsh-autocomplete


# --- Load these last in this specific order
zsh-users/zsh-autosuggestions
zsh-users/zsh-history-substring-search
zsh-users/zsh-syntax-highlighting

# --- Personal
MarkValadez/dotfiles path:plugins/devbox
MarkValadez/dotfiles path:plugins/astronomer


# --- Git Integration
ohmyzsh/ohmyzsh path:lib
ohmyzsh/ohmyzsh path:plugins/gh
ohmyzsh/ohmyzsh path:plugins/gitfast
ohmyzsh/ohmyzsh path:plugins/gitignore
ohmyzsh/ohmyzsh path:plugins/git-lfs

# --- System & Utils
ohmyzsh/ohmyzsh path:plugins/ssh-agent
ohmyzsh/ohmyzsh path:plugins/tmux
ohmyzsh/ohmyzsh path:plugins/systemd
ohmyzsh/ohmyzsh path:plugins/command-not-found
robbyrussell/oh-my-zsh path:plugins/colored-man-pages
