# shellcheck disable=SC2148

# theme
wintermi/zsh-starship
mattmc3/zdotdir path:plugins/starship-ftl

# zephyr
mattmc3/zephyr path:plugins/confd
mattmc3/zephyr path:plugins/history

# --- completions
mattmc3/ez-compinit
zsh-users/zsh-completions kind:fpath path:src

# --- suggestions
zsh-users/zsh-autosuggestions
zsh-users/zsh-history-substring-search

# --- ohmyzsh
ohmyzsh/ohmyzsh path:lib
ohmyzsh/ohmyzsh path:plugins/extract
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/gitfast

ohmyzsh/ohmyzsh path:plugins/fzf
ohmyzsh/ohmyzsh path:plugins/copypath
ohmyzsh/ohmyzsh path:plugins/copyfile
ohmyzsh/ohmyzsh path:plugins/ssh-agent
robbyrussell/oh-my-zsh path:plugins/colored-man-pages
robbyrussell/oh-my-zsh path:plugins/command-not-found

# --- syntax highlighting
z-shell/F-Sy-H
zsh-users/zsh-syntax-highlighting

# --- dir
z-shell/zsh-eza
fdellwing/zsh-bat

