# shellcheck disable=SC2148

# --- Core & Framework
ohmyzsh/ohmyzsh path:lib
mattmc3/zephyr path:plugins/confd
mattmc3/zephyr path:plugins/history

# --- Theme & Prompt
wintermi/zsh-starship
mattmc3/zdotdir path:plugins/starship-ftl

# --- Completions & Suggestions
mattmc3/ez-compinit
zsh-users/zsh-completions kind:fpath path:src
zsh-users/zsh-autosuggestions
zsh-users/zsh-history-substring-search

# --- Syntax Highlighting
z-shell/F-Sy-H

# --- Git Integration
ohmyzsh/ohmyzsh path:plugins/gitfast
ohmyzsh/ohmyzsh path:plugins/gh
ohmyzsh/ohmyzsh path:plugins/gitignore
ohmyzsh/ohmyzsh path:plugins/git-lfs


# --- Development Tools
ohmyzsh/ohmyzsh path:plugins/pip
ohmyzsh/ohmyzsh path:plugins/python
ohmyzsh/ohmyzsh path:plugins/direnv

# --- System & Utils
ohmyzsh/ohmyzsh path:plugins/ssh-agent
ohmyzsh/ohmyzsh path:plugins/tmux
ohmyzsh/ohmyzsh path:plugins/systemd
ohmyzsh/ohmyzsh path:plugins/command-not-found
robbyrussell/oh-my-zsh path:plugins/colored-man-pages
